-- phpMyAdmin SQL Dump
-- version 4.8.4
-- https://www.phpmyadmin.net/
--
-- Хост: 127.0.0.1
-- Время создания: Янв 11 2020 г., 14:42
-- Версия сервера: 10.1.37-MariaDB
-- Версия PHP: 7.3.0

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET AUTOCOMMIT = 0;
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- База данных: `glb`
--
CREATE DATABASE IF NOT EXISTS `glb` DEFAULT CHARACTER SET utf8 COLLATE utf8_general_ci;
USE `glb`;

-- --------------------------------------------------------

--
-- Структура таблицы `client_type`
--

CREATE TABLE `client_type` (
  `id` int(11) NOT NULL,
  `type` varchar(11) DEFAULT NULL,
  `COL 2` varchar(159) DEFAULT NULL,
  `COL 3` varchar(44) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `client_type`
--

INSERT INTO `client_type` (`id`, `type`, `COL 2`, `COL 3`) VALUES
(2, 'Адвокат', 'Адвокати', ''),
(3, 'АК', 'Арбітражні керуючі', ''),
(4, 'АС', 'Акредитовані суб\'єкти (КП, БТІ та ін.)', ''),
(5, 'БУ', 'Банківська установа', ''),
(6, 'ГтУЮ', 'ГтУЮ + відділи, сектори, управління (не УДВС ГтУЮ), в тому числі УДВС, УДР', ''),
(7, 'ВДВС', 'Відділ державної виконавчої служби районних, районних у містах, міських (міст обласного значення) управлінь юстиції, у т.ч відділи примусового виконання рішень', ''),
(8, 'ВДРАЦС', 'Відділи ДРАЦС', ''),
(9, 'ДНК', 'Державна нотаріальна контора', ''),
(10, 'ПН', 'Приватні нотаріуси', ''),
(11, 'ПВ', 'Приватні виконавці', ''),
(12, 'ДФС', 'ДПІ, ДФС', ''),
(13, 'МВС', 'Головні управління нацполіції, поліція охорони в областях, регіональні сервісні центри МВС в областях, управління кіберполіції', ''),
(14, 'ОДВ', 'РДА, управління соц.захисту РДА,  управління ЖКГ РДА / міста, служба у справах дітей, управління праці та соц.захисту, департаменти РДА / ОДА', ''),
(15, 'ОМС', 'Сільські, селищні, міськи ради та їх виконавчі комітети', ''),
(16, 'ЦНАП', 'Відділи / центри надання адмін.послуг виконкомів / ОМС / РДА', ''),
(17, 'ЦНАП ОДВ', 'Відділи / центри надання адмін.послуг райдержадмінстрації', 'може використовуватись замість значення ЦНАП'),
(18, 'ЦНАП ОМС', 'Відділи / центри надання адмін.послуг органів місцевого самоврядування (виконкомів)', 'може використовуватись замість значення ЦНАП'),
(19, 'Прокуратура', 'Прокуратура', ''),
(20, 'СБУ', 'СБУ', ''),
(21, 'Суд', 'Суди', ''),
(22, 'ЦНБВПД', 'Центри з надання безоплатної вторинної правової допомоги', ''),
(23, 'Інші', 'Сільськогосподарські підприємства, фермерські господарства, фінансово-господарські установи (не банки), кредитні спілки, ФОП/ТОВ (користувачі МРО) ', ''),
(24, 'Офіс', 'Офіс філії', ''),
(25, 'Усі', 'Декілька типів заявників, за бажанням можете розшифрувати у полі \"Заявник\"', ''),
(26, 'МЮУ', 'МЮУ (для Київ обл філії)', '');

-- --------------------------------------------------------

--
-- Структура таблицы `know`
--

CREATE TABLE `know` (
  `id` int(11) NOT NULL,
  `title` text NOT NULL,
  `full` text NOT NULL,
  `solution` text NOT NULL,
  `screen` text,
  `zip` text,
  `resource` text NOT NULL,
  `date` timestamp NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `know`
--

INSERT INTO `know` (`id`, `title`, `full`, `solution`, `screen`, `zip`, `resource`, `date`) VALUES
(1, 'Помилка локального кешу', 'Помилка локального кешу. Рекомендовано перезапустити программу. ', ' 1. Распаковать Data.rar в C:\\Program Files\\EDR_EDS\\Data <br />\r\nили\r\n2.  в ЕДР: Адміністрування → Оновити довідники ', '/views/know/screen/1534857115едр пом.png', '/views/know/zip/1534857115Data.rar', '21', '2018-08-21 13:11:55'),
(2, 'Ошибка OCSP сервера', ' Виникла помилка при спробі отримати статус сертифікату за протоколом OCSP. Зверніться до системного адміністратора.                     ', '<ol>\r\n<li> <p style=\'color: red\'> Возможно глобальные проблемы с сервером </p></li>\r\n<li>Не указан OCSP сервер в настройках АЦСК </li>\r\n<li> Удалить \"Користувач АЦСК\", очистить реестр windows по ключу \"Institute\", установить АЦСК и настроить его заново, скачать заново сертификаты </li>\r\n</ol>                     ', '/views/know/screen/1535013892ocsp.png', '', '8', '2018-08-23 08:50:27'),
(3, 'Помилка Ajax-запиту', ' Помилка Ajax-запиту', ' В поле есть апостроф.<br /> \r\n\r\n<b> Решение : </b> <br />\r\n- заменить апостроф с клавиши с буквой \"Э\", <br />\r\nна апостроф с клавиши с буквой \"Ё\". ', '/views/know/screen/1535352685ajax.png', NULL, '28', '2018-08-27 06:51:25'),
(4, 'Некоректний сертифікат', ' Некоректний сертифікат, закритий ключ або ім\'я користувача  <br /> \r\nundefined <br />\r\nStackTrace: UBError: msgInvalidSertAuth\r\n  ', ' <ol>\r\n<li> Пользователь не зарегистрирован (поставить галочку при входе)</li> <br />\r\n<li>Отсутствует \"Користувач АЦСК\" или не скачаны сертификаты</li> <br />\r\n<li>В хранилище сертификаты разных пользователей или недействительные сертификаты того же пользователя</li> <br />\r\n<li>Траффик пользователя проходит через прокси-сервер</li> <br />\r\n<li>Не указан OCSP-сервер или папка с сертификатами в настройках \"Користувача АЦСК\"</li> <br />\r\n<li>\"Користувач АЦСК\" одного АЦСК, а ключ от другого</li> <br />\r\n<li>Переуставка \"Користувача АЦСК\" и очистка реестра Windows, поиск по ключу \" Institute\"</li> <br /> \r\n<li>Неверный пароль пользователя</li> <br />\r\n</ol>  ', '/views/know/screen/1535445782msgInvalidCertAuth.png', '', '7', '2018-08-28 08:45:08'),
(5, 'Установка .NET Framework 3.5 из дистрибутива Windows 10', '   ', 'Вставляем диск с Windows 10 в CD-Rom (или монтируем образ средствами системы или Daemon Tools);\r\nЗапустить утилиту командной строки (CMD) с правами администратора;\r\nВыполняем следующую команду:<br />\r\n<b><i> Dism /online /enable-feature /featurename:NetFx3 /All /Source:D:\\sources\\sxs /LimitAccess </i></b> <br />\r\nВ команде выше — D: — буква диска или смонтированного образа.\r\n\r\nВторой вариант этого же способа: копируем с диска или образа папку «\\sources\\sxs\\» на диск «C», в его корень.\r\n\r\nЗатем запускаете команду:<br />\r\n<b><i>\r\ndism.exe /online /enable-feature /featurename:NetFX3 /Source:c:\\sxs\r\ndism.exe /Online /Enable-Feature /FeatureName:NetFx3 /All /Source:c:\\sxs /LimitAccess    </i></b>', '', '', '8', '2019-02-08 07:31:17'),
(6, 'Дані на сервері не знайдені(Google Chrome)', ' Дані на сервері не знайдені. Зверніться, будь ласка до адміністраторів системи.', ' Помилка у Google Chrome. На Opera повинно усе робити', '/views/know/screen/1550152619Безымянный.jpg', NULL, '7', '2019-02-14 13:56:59');

-- --------------------------------------------------------

--
-- Структура таблицы `lang`
--

CREATE TABLE `lang` (
  `id` int(11) NOT NULL,
  `num` int(11) NOT NULL,
  `phrase` text NOT NULL,
  `module` text NOT NULL,
  `lang` text NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `lang`
--

INSERT INTO `lang` (`id`, `num`, `phrase`, `module`, `lang`) VALUES
(1, 1, 'Корпоративный портал <br /> Одесской филии ГП \"НАИС\" ', '0,1,2,3,4,5,6', 'RU'),
(2, 1, 'Корпоративний портал <br /> Одеської філії ДП \"НАІС\" ', '0,1,2,3,4,5,6', 'UA'),
(4, 0, 'Одеська філія ДП \"НАІС\"', '0,1,2,3,4,5,6', 'UA'),
(5, 0, 'Одесcкая филия ГП \"НАИС\"', '0,1,2,3,4,5,6', 'RU'),
(6, 3, 'Января', '0,1,2,3,4,5,6', 'RU'),
(7, 4, 'Февраля', '0,1,2,3,4,5,6', 'RU'),
(8, 5, 'Марта', '0,1,2,3,4,5,6', 'RU'),
(9, 6, 'Апреля', '0,1,2,3,4,5,6', 'RU'),
(10, 7, 'Мая', '0,1,2,3,4,5,6', 'RU'),
(11, 8, 'Июня', '0,1,2,3,4,5,6', 'RU'),
(12, 9, 'Июля', '0,1,2,3,4,5,6', 'RU'),
(13, 10, 'Августа', '0,1,2,3,4,5,6', 'RU'),
(14, 11, 'Сентября', '0,1,2,3,4,5,6', 'RU'),
(15, 12, 'Октября', '0,1,2,3,4,5,6', 'RU'),
(16, 13, 'Ноября', '0,1,2,3,4,5,6', 'RU'),
(17, 14, 'Декабря', '0,1,2,3,4,5,6', 'RU'),
(18, 3, 'Січня', '0,1,2,3,4,5,6', 'UA'),
(19, 4, 'Лютого', '0,1,2,3,4,5,6', 'UA'),
(20, 5, 'Березня', '0,1,2,3,4,5,6', 'UA'),
(21, 6, 'Квітня', '0,1,2,3,4,5,6', 'UA'),
(22, 7, 'Травня', '0,1,2,3,4,5,6', 'UA'),
(23, 8, 'Червня', '0,1,2,3,4,5,6', 'UA'),
(24, 9, 'Липня', '0,1,2,3,4,5,6', 'UA'),
(25, 10, 'Серпня', '0,1,2,3,4,5,6', 'UA'),
(26, 11, 'Вересня', '0,1,2,3,4,5,6', 'UA'),
(27, 12, 'Жовтня', '0,1,2,3,4,5,6', 'UA'),
(28, 13, 'Листопада', '0,1,2,3,4,5,6', 'UA'),
(29, 14, 'Грудня', '0,1,2,3,4,5,6', 'UA'),
(30, 15, 'Воскресенье', '0,1,2,3,4,5,6', 'RU'),
(31, 16, 'Понедельник', '0,1,2,3,4,5,6', 'RU'),
(32, 17, 'Вторник', '0,1,2,3,4,5,6', 'RU'),
(33, 18, 'Среда', '0,1,2,3,4,5,6', 'RU'),
(34, 19, 'Четверг', '0,1,2,3,4,5,6', 'RU'),
(35, 20, 'Пятница', '0,1,2,3,4,5,6', 'RU'),
(36, 21, 'Суббота', '0,1,2,3,4,5,6', 'RU'),
(37, 15, 'Неділя', '0,1,2,3,4,5,6', 'UA'),
(38, 16, 'Понеділок', '0,1,2,3,4,5,6', 'UA'),
(39, 17, 'Вівторок', '0,1,2,3,4,5,6', 'UA'),
(40, 18, 'Середа', '0,1,2,3,4,5,6', 'UA'),
(41, 19, 'Четверг', '0,1,2,3,4,5,6', 'UA'),
(42, 20, 'П`ятниця', '0,1,2,3,4,5,6', 'UA'),
(43, 21, 'Субота', '0,1,2,3,4,5,6', 'UA'),
(44, 22, 'Главная', '0,1,2,3,4,5,6', 'RU'),
(45, 22, 'Головна', '0,1,2,3,4,5,6', 'UA'),
(46, 23, 'Обращения', '0,1,2,3,4,5,6', 'RU'),
(47, 23, 'Звернення', '0,1,2,3,4,5,6', 'UA'),
(48, 24, 'Договора', '0,1,2,3,4,5,6', 'RU'),
(49, 24, 'Договори', '0,1,2,3,4,5,6', 'UA'),
(50, 25, 'Почта', '0,1,2,3,4,5,6', 'RU'),
(51, 25, 'Пошта', '0,1,2,3,4,5,6', 'UA'),
(52, 26, 'Выезды', '0,1,2,3,4,5,6', 'RU'),
(53, 26, 'Виїзди', '0,1,2,3,4,5,6', 'UA'),
(54, 27, 'Добрый день, ', '0,1,2,3,4,5,6', 'RU'),
(55, 27, 'Доброго дня, ', '0,1,2,3,4,5,6', 'UA'),
(56, 28, 'База знаний', '0,1,2,3,4,5,6', 'RU'),
(58, 28, 'База знань', '0,1,2,3,4,5,6', 'UA'),
(59, 29, 'Январь', '0,1,2,3,4,5,6,7', 'RU'),
(60, 30, 'Февраль', '0,1,2,3,4,5,6,7', 'RU'),
(61, 31, 'Март', '0,1,2,3,4,5,6,7', 'RU'),
(62, 32, 'Апрель', '0,1,2,3,4,5,6,7', 'RU'),
(63, 33, 'Май', '0,1,2,3,4,5,6,7', 'RU'),
(64, 34, 'Июнь', '0,1,2,3,4,5,6,7', 'RU'),
(65, 35, 'Июль', '0,1,2,3,4,5,6,7', 'RU'),
(66, 36, 'Август', '0,1,2,3,4,5,6,7', 'RU'),
(67, 37, 'Сентябрь', '0,1,2,3,4,5,6,7', 'RU'),
(68, 38, 'Октябрь', '0,1,2,3,4,5,6,7', 'RU'),
(69, 39, 'Ноябрь', '0,1,2,3,4,5,6,7', 'RU'),
(70, 40, 'Декабрь', '0,1,2,3,4,5,6,7', 'RU'),
(71, 29, 'Січень', '0,1,2,3,4,5,6,7', 'UA'),
(72, 30, 'Лютий', '0,1,2,3,4,5,6,7', 'UA'),
(73, 31, 'Березень', '0,1,2,3,4,5,6,7', 'UA'),
(74, 32, 'Квітень', '0,1,2,3,4,5,6,7', 'UA'),
(75, 33, 'Травень', '0,1,2,3,4,5,6,7', 'UA'),
(76, 34, 'Червень', '0,1,2,3,4,5,6,7', 'UA'),
(77, 35, 'Липень', '0,1,2,3,4,5,6,7', 'UA'),
(78, 36, 'Серпень', '0,1,2,3,4,5,6,7', 'UA'),
(79, 37, 'Вересень', '0,1,2,3,4,5,6,7', 'UA'),
(80, 38, 'Жовтень', '0,1,2,3,4,5,6,7', 'UA'),
(81, 39, 'Листопад', '0,1,2,3,4,5,6,7', 'UA'),
(82, 40, 'Грудень', '0,1,2,3,4,5,6,7', 'UA');

-- --------------------------------------------------------

--
-- Структура таблицы `mail_type`
--

CREATE TABLE `mail_type` (
  `id` int(11) NOT NULL,
  `alias` text CHARACTER SET utf8 NOT NULL,
  `fullname` text CHARACTER SET utf8 NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=latin1;

--
-- Дамп данных таблицы `mail_type`
--

INSERT INTO `mail_type` (`id`, `alias`, `fullname`) VALUES
(1, 'ОЮ', 'Органи Юстиції'),
(2, 'РС', 'Реєстраційні служби'),
(3, 'ДРАЦС', 'Відділи ДРАЦС'),
(4, 'ДВС', 'Відділи ДВС'),
(5, 'ДНК', 'ДНК ПН'),
(6, 'Філія', 'Філія');

-- --------------------------------------------------------

--
-- Структура таблицы `resource`
--

CREATE TABLE `resource` (
  `id` int(11) NOT NULL,
  `resource` varchar(15) DEFAULT NULL,
  `COL 2` varchar(242) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `resource`
--

INSERT INTO `resource` (`id`, `resource`, `COL 2`) VALUES
(1, 'РНБ', 'Єдиний реєстр спеціальних бланків нотаріальних документів'),
(2, 'РСМ', 'Державний реєстр друкованих засобів масової інформації та інформаційних агентств як суб\'єктів інформаційної діяльності, Єдиний реєстр громадських формувань, Реєстр громадських об’єднань'),
(3, 'ДРОРМ', 'Державний реєстр обтяжень рухомого майна'),
(4, 'МРО', 'Модернізований реєстр обтяжень'),
(5, 'СР', 'Спадковий реєстр'),
(6, 'ЄРД', 'Єдиний реєстр довіреностей'),
(7, 'ДРАЦС АРМ', 'Державний реєстр актів цивільного стану громадян'),
(8, 'ДРАЦС web', 'Державний реєстр актів цивільного стану громадян'),
(9, 'ЄРПБ', 'Єдиний реєстр підприємств, щодо яких порушено провадження у справі про банкрутство'),
(10, 'ДРРП АРМ', 'Державний реєстр речових прав на нерухоме майно '),
(11, 'ДРРП UB ', 'Державний реєстр речових прав на нерухоме майно '),
(12, 'ЄДРОК UB', 'Єдиний державний реєстр осіб, які вчинили корупційні правопорушення'),
(13, 'ЛЮСТР. UB', 'Єдиний державний реєстр осіб, щодо яких застосовано положення Закону України \"Про очищення влади\"'),
(14, 'ЕРА UB ', 'Електронний реєстр апостилів'),
(15, 'ЄДР АРМ', 'Єдиний державний реєстр юридичних осіб, фізичних осіб – підприємців та громадських формувань'),
(16, 'ЄДР web', 'Єдиний державний реєстр юридичних осіб, фізичних осіб – підприємців та громадських формувань'),
(17, 'АСВП', 'Автоматизована система виконавчого провадження'),
(18, 'АСВП UB ', 'Автоматизована система виконавчого провадження'),
(19, 'СЕЗАК', 'Система електронної звітності арбітражних керуючих'),
(20, 'СЕЗН', 'Система електронної звітності нотаріусів'),
(21, 'ЕЦП ', 'Проблеми у користувача із ЕЦП'),
(22, 'Підключення', 'Підключення Користувача до ряду реєстрів'),
(23, 'ВКЗ', 'Роботи / консультації по налаштуванню ВКЗ'),
(24, 'Увага', 'Глобальні проблеми у ряда користувачів з певним реєстром / системою'),
(25, 'Зв\'язок', 'Роботи / консультації по налаштуванню каналу зв\'язку Філії'),
(26, 'Реєстри', 'Проблема у одного користувача з кількома реєстрами / системами'),
(27, 'Усі нотаріальні', 'Проблема у нотаріуса з усіма реєстрами / системами'),
(28, 'Усі АРМи', 'Проблема у користувача з усіма АРМами реєстрів (нотаріальні та/або ДРАЦС та/або ЄДР)'),
(29, 'Усі UB', 'Масова проблема з UB'),
(30, 'Увага', 'Глобальні проблеми у ряда користувачів з певним реєстрами / системами'),
(31, 'РДП', 'Проблема із віддаленим робочим столом'),
(32, 'ЕЦП', 'Проблеми у користувача із ЕЦП (консультація зі скачування сертифікатів, підозра на блокування ключа в наслідок великої кількості не вірно введених паролів, консультація з підключення зчитувача id-карт, перевстановлення Користувача-ІІТ та ін.)'),
(33, 'Ел.пошта', 'Проблеми з електронною поштою @minjust.gov.ua'),
(34, 'Інше', 'Інші питання'),
(35, 'UB', '');

-- --------------------------------------------------------

--
-- Структура таблицы `resource_know`
--

CREATE TABLE `resource_know` (
  `id` int(11) NOT NULL,
  `resource` text CHARACTER SET utf8 NOT NULL,
  `title` text CHARACTER SET utf8 NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=latin1;

--
-- Дамп данных таблицы `resource_know`
--

INSERT INTO `resource_know` (`id`, `resource`, `title`) VALUES
(1, 'РНБ', 'Реєст нотаріальних бланків'),
(7, 'Усі UB', 'Проблеми з реєстрами на платформі Unity Base'),
(8, 'Усі АРМи', 'Проблема у користувачів з усіма АРМами реєстрів (нотаріальні та/або ДРАЦС та/або ЄДР)'),
(18, 'АСВП UB ', 'Автоматизована система виконавчого провадження'),
(21, 'ЄДР АРМ', 'Єдиний державний реєстр юридичних осіб, фізичних осіб – підприємців та громадських формувань'),
(22, 'ЕРА UB ', 'Електронний реєстр апостилів'),
(23, 'ЛЮСТР. UB', 'Єдиний державний реєстр осіб, щодо яких застосовано положення Закону України \"Про очищення влади\"'),
(24, 'ЄДРОК UB', 'Єдиний державний реєстр осіб, які вчинили корупційні правопорушення'),
(25, 'ДРРП UB ', 'Державний реєстр речових прав на нерухоме майно '),
(26, 'ДРРП АРМ', 'Державний реєстр речових прав на нерухоме майно АРМ'),
(27, 'ЄРПБ', 'Єдиний реєстр підприємств, щодо яких порушено провадження у справі про банкрутство'),
(28, 'ДРАЦС web', 'Державний реєстр актів цивільного стану громадян'),
(29, 'ДРАЦС АРМ', 'Державний реєстр актів цивільного стану громадян АРМ'),
(30, 'ЄРД', 'Єдиний реєстр довіреностей'),
(31, 'СР', 'Спадковий реєстр'),
(32, 'МРО', 'Модернізований реєстр обтяжень'),
(33, 'ДРОРМ', 'Державний реєстр обтяжень рухомого майна'),
(34, 'РСМ', 'Державний реєстр друкованих засобів масової інформації та інформаційних агентств як суб\'єктів інформаційної діяльності, Єдиний реєстр громадських формувань, Реєстр громадських об’єднань'),
(35, 'ЕЦП', 'Проблеми у користувача із ЕЦП '),
(36, 'Інше', 'Інші питання'),
(37, 'СЕЗН', 'Система електронної звітності нотаріусів'),
(38, 'СЕЗАК', 'Система електронної звітності арбітражних керуючих');

-- --------------------------------------------------------

--
-- Структура таблицы `users`
--

CREATE TABLE `users` (
  `id` int(11) NOT NULL,
  `filial` varchar(2) CHARACTER SET utf8 NOT NULL,
  `short_name` text CHARACTER SET utf8 NOT NULL,
  `full_name` text CHARACTER SET utf8 NOT NULL,
  `birthday` date NOT NULL,
  `jobday` date NOT NULL,
  `level_access` text CHARACTER SET utf8 NOT NULL,
  `position` text CHARACTER SET utf8 NOT NULL,
  `email` text CHARACTER SET utf8 NOT NULL,
  `phone` text CHARACTER SET utf8 NOT NULL,
  `vphone` text CHARACTER SET utf8 NOT NULL,
  `dep` varchar(3) CHARACTER SET utf8 NOT NULL,
  `login` text CHARACTER SET utf8 NOT NULL,
  `pass` text CHARACTER SET utf8 NOT NULL,
  `lang` text CHARACTER SET utf8 NOT NULL,
  `snow` int(11) NOT NULL,
  `avatar` text CHARACTER SET utf8 NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=latin1;

--
-- Дамп данных таблицы `users`
--

INSERT INTO `users` (`id`, `filial`, `short_name`, `full_name`, `birthday`, `jobday`, `level_access`, `position`, `email`, `phone`, `vphone`, `dep`, `login`, `pass`, `lang`, `snow`, `avatar`) VALUES
(1, 'od', 'Бойченко О.О.', 'Бойченко Олександр Олександрович', '1981-04-13', '1970-01-01', '000000', 'Завідувач сектору технічного супроводження', '', '752-81-11', '4813', 'ing', 'boichenko', 'fired', 'RU', 0, ''),
(2, 'od', 'Корнієнко К.Ю.', 'Корнієнко Костянтин Юрійович', '0000-00-00', '0000-00-00', '222222', 'Інженер 1 категорії сектору технічного супроводження', '', '-', '-', 'ing', 'kornienko', 'fired', '', 0, ''),
(3, 'od', 'Соколов Є.І.', 'Соколов Євгеній Іванович', '1994-05-17', '2017-09-26', '0200000', 'Інженер з комп`ютерних систем I категорії сектору технічного супроводження', 'ye.sokolov@nais.gov.ua', '752-81-53', '4810', 'ing', 'sokolov', '54997d874363608508a52670e2b59357', 'RU', 1, ''),
(4, 'od', 'Біленко М.О.', 'Біленко Максим Олександрович', '1986-01-05', '2018-03-01', '000000', 'Інженер з комп`ютерних систем II категорії сектору технічного супроводження', '', '752-81-54', '4811', 'ing', 'bilenko', '01c44115071218ae1df1dab90081b1f0', 'RU', 1, 'bilenko.jpg'),
(5, 'od', 'Ковальов Р. М.', 'Ковальов Руслан Михайлович', '1989-03-23', '2019-07-15', '121211', 'Директор', 'r.kovalov@nais.gov.ua', '752-80-14', '4803', 'adm', 'kovalov', '6ad2c57a250eaf63185e0e0597eb2f5d', 'UA', 0, ''),
(7, 'od', 'Пужакова А.І.', 'Пужакова Анна Іванівна', '1984-12-03', '1970-01-01', '121111', 'Завідувач сектору з надання послуг електронного цифрового підпису ', 'a.puzhakova@od.nais.gov.ua', '752-82-15', '4818', 'ecp', 'a.puzhakova', '53cbe72aa1aa06078bf7f41d737c520b', 'UA', 1, ''),
(8, 'od', 'Пліс Т.Ю.', 'Пліс Тетяна Юріївна', '1977-05-06', '0000-00-00', '222222', 'Завідувач сектору по підтримці інформаційних систем ', '', '752-82-10', '4809', 'inf', 't.plis', '1122', 'UA', 0, ''),
(9, 'od', 'Савченко І.М.', 'Савченко Інна Миколаївна', '1980-04-25', '1970-01-01', '222212', 'Старший адміністратор даних сектору по підтримці інформаційних систем ', '', '752-82-11', '4814', 'inf', 'i.savchenko', '8f72f60dd9a5473bfbff03f6a1e85215', 'UA', 0, ''),
(10, 'od', 'Прохорова М.А.', 'Прохорова Марія Анатоліївна', '1984-01-07', '0000-00-00', '222222', 'Адміністратор даних I категорії сектору по підтримці інформаційних систем ', '', '752-82-12', '4815', 'inf', 'm.prohorova', '1122', 'UA', 0, ''),
(11, 'od', 'Дмітрієва Г.В.', 'Дмитрієва Ганна Володимирівна', '1989-12-21', '0000-00-00', '222222', 'Адміністратор даних I категорії сектору по підтримці інформаційних систем ', '', '752-82-14', '4817', 'inf', 'g.dmitriyeva', '1122', 'UA', 0, ''),
(12, 'od', 'Пінчук Т.В.', 'Пінчук Тетяна Віталіївна', '1987-12-11', '0000-00-00', '222222', 'Адміністратор даних I категорії сектору по підтримці інформаційних систем ', '', '752-82-13', '4816', 'inf', 't.pinchuk', '1122', 'UA', 0, ''),
(13, 'od', 'Пашкевич О.М.', 'Пашкевич Олена Михайлівна', '1980-08-30', '0000-00-00', '222222', 'Адміністратор даних IІ категорії сектору по підтримці інформаційних систем ', '', '752-80-71', '4804', 'inf', 'o.pashkevich', '1122', 'UA', 0, ''),
(14, 'od', 'Набитович О.В.', 'Набитович Олена Вікторівна', '1977-04-11', '0000-00-00', '222222', 'Адміністратор даних ІIІ категорії сектору по підтримці інформаційних систем ', '', '752-80-72', '4805', 'inf', 'o.nabitovich', '1122', 'UA', 0, ''),
(15, 'od', 'Кашина О.В.', 'Кашина Ольга Василівна', '1985-05-09', '0000-00-00', '222222', 'Адміністратор даних сектору по підтримці інформаційних систем ', '', '752-80-13', '4802', 'inf', 'o.kashina', '1122', 'UA', 0, ''),
(16, 'od', 'Адаховська З.В.', 'Адаховська Зоя Василівна', '1958-06-08', '0000-00-00', '222222', 'Реєстратор даних сектору по підтримці інформаційних систем ', '', '752-80-73', '4806', 'inf', 'z.adahovska', '1122', 'UA', 0, ''),
(17, 'od', 'Ковалик С.М.', 'Ковалик Сергій Миколайович', '1982-12-05', '0000-00-00', '222222', 'Інженер з комп`ютерних систем І категорії сектору з надання послуг електронного цифрового підпису', '', '752-82-16', '4819', 'ecp', 's.kovalik', '1122', 'UA', 0, ''),
(18, 'od', 'Мельніченко К.Г.', 'Мельніченко Ксенія Григорівна', '1990-12-07', '0000-00-00', '222222', 'Інженер з комп`ютерних систем І категорії сектору з надання послуг електронного цифрового підпису', '', '752-82-17', '4820', 'ecp', 'k.melnichenko', '1122', 'UA', 0, ''),
(19, 'od', 'Аврамова І.С.', 'Аврамова Ірина Сергіївна', '1970-09-10', '1989-01-01', '222222', 'Адміністратор данних', '', '752-80-74', '4807', 'inf', 'i.avramova', 'bd1517b3896473bde6b87d001d1ec8e5', 'UA', 0, ''),
(20, 'od', 'Пергаєв М.Є.', 'Пергаєв Михайло Євгенович', '1971-12-12', '1970-01-01', '121212', 'Помічник директора', 'm.perhaiev@od.nais.gov.ua', '752-80-07', '4801', 'adm', 'pergaev', '847b18a781a2af2489bc44916ba95519', 'UA', 1, ''),
(21, 'od', 'Куралова А. О.', 'Куралова Анастасія Олегівна', '1992-09-19', '1970-01-01', '101111', 'Адміністратор даних', 'a.kuralova@od.nais.gov.ua', '752-81-10', '4808', 'adm', 'kuralova', 'a81338b23b21acbedacb5c2f4ba771b7', 'UA', 1, '');

--
-- Индексы сохранённых таблиц
--

--
-- Индексы таблицы `client_type`
--
ALTER TABLE `client_type`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `id` (`id`),
  ADD UNIQUE KEY `id_2` (`id`),
  ADD KEY `id_3` (`id`);

--
-- Индексы таблицы `know`
--
ALTER TABLE `know`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `lang`
--
ALTER TABLE `lang`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `mail_type`
--
ALTER TABLE `mail_type`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `resource`
--
ALTER TABLE `resource`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `resource_know`
--
ALTER TABLE `resource_know`
  ADD PRIMARY KEY (`id`),
  ADD KEY `id` (`id`);

--
-- Индексы таблицы `users`
--
ALTER TABLE `users`
  ADD PRIMARY KEY (`id`);

--
-- AUTO_INCREMENT для сохранённых таблиц
--

--
-- AUTO_INCREMENT для таблицы `client_type`
--
ALTER TABLE `client_type`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=27;

--
-- AUTO_INCREMENT для таблицы `know`
--
ALTER TABLE `know`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=7;

--
-- AUTO_INCREMENT для таблицы `lang`
--
ALTER TABLE `lang`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=83;

--
-- AUTO_INCREMENT для таблицы `mail_type`
--
ALTER TABLE `mail_type`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=7;

--
-- AUTO_INCREMENT для таблицы `resource`
--
ALTER TABLE `resource`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=36;

--
-- AUTO_INCREMENT для таблицы `resource_know`
--
ALTER TABLE `resource_know`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=39;

--
-- AUTO_INCREMENT для таблицы `users`
--
ALTER TABLE `users`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=22;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
